ep-load-test/tests/attendee-rest-dev.yml
# Before run, make sure:
# 1. Update mongodb(M40) to prod size;
# 2. Update ecs attendee to match prod(8-32);

config:
  target: "https://attendees.dev.events.q4inc.com/rest/v1"
  ensure:
    max: 10000 # fail if max response time exceeds 5000ms
    maxErrorRate: 4 # fail if error rate exceeds 0%
  phases:
    - duration: 10           # 5 min
      arrivalRate: 1        # 166 attendee's per second ~ 10k per minute
      # rampTo: 300
      name: "Attendee rest load test 300-166-333-909330596"
  processor: "./hooks/generateAuthTokens.js"
  variables:
    testDuration: 1
    meetingId: 909330596
    wsUrl: "wss://attendees.dev.events.q4inc.com/graphql?x-meeting-id=909330596&x-company-id=5ff782c52dab34000885fe61&ep-wss=true"
scenarios:
  - name: "Perform Attendee http journey to console"
    flow:
      - get:
          url: "/flags"
      - get:
          url: "/event/{{ meetingId }}"
      - get:
          beforeRequest: setIdToken
          url: "/attendee/public/profile?authToken={{ id_token }}"
      - think: 2
      - get:
          url: "/event/{{ meetingId }}"
      - get:
          url: "/flags"
      - get:
          url: "/auth/token/{{ meetingId }}"
          capture:
            - json: '$.data.token'
              as: 'access_token'
      - post:
          url: "/attendee"
          headers:
            Authorization: "Bearer {{ access_token }}"
          json:
            attendeeType: "GUEST"
            email: "{{ email }}"
            firstName: "{{ $randomString() }}"
            investorType: "individual"
            lastName: "{{ $randomString() }}"
            meetingId: "{{ meetingId }}"
            registrationType: "LOBBY"
            sendReminderEmail: true
            type: "Q4_LOGIN"
            wsConnectionId: "{{ wsConnectionId }}"
          capture:
            - json: '$.data.id'
              as: 'attendeeId'
      - loop:
          - get:
              url: "/event/{{ meetingId }}/broadcast-status"
              headers:
                Authorization: "Bearer {{ access_token }}"
          - think: 1
        count: 5
      - get:
          url: "/event/{{ meetingId }}/slides"
          headers:
            Authorization: "Bearer {{ access_token }}"
      - function: executeSubscription