ep-load-test/tests/attendee-rest-dev.yml
# Before run, make sure:
# 1. Update mongodb(M40) to prod size;
# 2. Update ecs attendee to match prod(8-32);
# 3. Bump redis to t3.medium;

config:
  target: "https://attendees.stage.events.q4inc.com/rest/v1"
  ensure:
    max: 10000 # fail if max response time exceeds 5000ms
    maxErrorRate: 4 # fail if error rate exceeds 0%
  phases:
    - duration: 300 # 5 min
      arrivalRate: 150 # 188 attendee's per second ~ 10k per minute
      rampTo: 300
      name: "Attendee rest load test 1-1-375"
      # - duration: 10 # 1 min
      #   arrivalRate: 1 # 188 attendee's per second ~ 10k per minute
      #   name: "Attendee rest load test 1-1-375"
  processor: "./hooks/generateAuthTokens.js"
  variables:
    testDuration: 300
    # testDuration: 1
    meetingId: 673182521
    wsUrl: "wss://attendees.stage.events.q4inc.com/graphql?x-meeting-id=673182521&meetingId=673182521&x-company-id=646d14077cf897e6805dd3e7&ep-wss=true"
scenarios:
  - name: "Perform Attendee http journey to console"
    flow:
      - get:
          url: "/flags"
      - get:
          url: "/event/{{ meetingId }}"
      - get:
          url: "/auth/token/{{ meetingId }}"
          capture:
            - json: "$.data.token"
              as: "access_token"
      - post:
          beforeRequest: setupAttendee
          url: "https://attendees.stage.events.q4inc.com/rest/v2/attendee"
          headers:
            Authorization: "Bearer {{ access_token }}"
          json:
            attendeeType: "GUEST"
            email: "{{ email }}"
            firstName: "{{ $randomString() }}"
            investorType: "individual"
            lastName: "{{ $randomString() }}"
            meetingId: "{{ meetingId }}"
            registrationType: "LOBBY"
            sendReminderEmail: true
            type: "Q4_LOGIN"
            wsConnectionId: "{{ wsConnectionId }}"
          capture:
            - json: "$.data.id"
              as: "attendeeId"
      - get:
          url: "/event/{{ meetingId }}"
      - loop:
          - get:
              url: "/event/{{ meetingId }}/broadcast-status"
              headers:
                Authorization: "Bearer {{ access_token }}"
          - think: 1
        count: 5
      - get:
          url: "/event/{{ meetingId }}/slides"
          headers:
            Authorization: "Bearer {{ access_token }}"
      - function: executeSubscription